Repository: airwallex/airwallex-payment-ios
Catalog: Airwallex/AirwallexPaymentSheet/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pt_br, pt_pt, ru, th, zh_hans, zh_hant

source: Add new
de: Neu hinzufügen
es: Agregar nuevo
fr: Ajouter nouveau
ja: 新規追加
ko: 새로 추가
pt_br: Adicionar novo
pt_pt: Adicionar novo
ru: Добавить новую
th: เพิ่มใหม่
zh_hans: 新增
zh_hant: 新增

source: Billing Address
de: Rechnungsadresse
es: Dirección de facturación
fr: Adresse de facturation
ja: 請求先住所
ko: 청구지 주소
pt_br: Endereço de cobrança
pt_pt: Morada de faturação
ru: Платежный адрес
th: ที่อยู่สำหรับออกใบเสร็จ
zh_hans: 账单地址
zh_hant: 帳單地址

source: Billing country or region
de: Rechnungsland oder -region
es: País o región de facturación
fr: Pays ou région de facturation
ja: 請求先の国または地域
ko: 청구 국가 또는 지역
pt_br: País ou região de cobrança
pt_pt: País ou região de faturação
ru: Страна или регион для выставления счета
th: ประเทศหรือภูมิภาคสำหรับออกใบเสร็จ
zh_hans: 账单国家或地区
zh_hant: 帳單國家或地區

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pt_br: Cancelar
pt_pt: Cancelar
ru: Отмена
th: ยกเลิก
zh_hans: 取消
zh_hant: 取消

source: Card Information
de: Karteninformationen
es: Información de la tarjeta
fr: Informations sur la carte
ja: カード情報
ko: 카드 정보
pt_br: Informações do cartão
pt_pt: Informação do cartão
ru: Информация о карте
th: ข้อมูลบัตร
zh_hans: 卡片信息
zh_hant: 卡片資訊

source: Card’s expiration date is invalid
de: Ablaufdatum der Karte ist ungültig
es: La fecha de vencimiento de la tarjeta no es válida
fr: La date d’expiration de la carte est invalide
ja: カードの有効期限が無効です
ko: 카드의 만료 날짜가 유효하지 않습니다
pt_br: A data de validade do cartão é inválida
pt_pt: Data de validade do cartão inválida
ru: Недействительный срок действия карты
th: วันหมดอายุของบัตรไม่ถูกต้อง
zh_hans: 卡片的到期日无效
zh_hant: 卡片到期日無效

source: Change
de: Ändern
es: Cambiar
fr: Modifier
ja: 変更
ko: 변경
pt_br: Alterar
pt_pt: Alterar
ru: Изменить
th: เปลี่ยน
zh_hans: 更改
zh_hant: 變更

source: Choose a card
de: Karte auswählen
es: Elegir una tarjeta
fr: Choisir une carte
ja: カードを選択
ko: 카드 선택
pt_br: Escolher um cartão
pt_pt: Escolher um cartão
ru: Выбрать карту
th: เลือกบัตร
zh_hans: 选择一张卡
zh_hant: 選擇卡片

source: City
de: Stadt
es: Ciudad
fr: Ville
ja: 市区町村
ko: 도시
pt_br: Cidade
pt_pt: Cidade
ru: Город
th: เมือง
zh_hans: 城市
zh_hant: 城市

source: Close
de: Schließen
es: Cerrar
fr: Fermer
ja: 閉じる
ko: 닫기
pt_br: Fechar
pt_pt: Fechar
ru: Закрыть
th: ปิด
zh_hans: 关闭
zh_hant: 關閉

source: Expiry date is required
de: Ablaufdatum ist erforderlich
es: La fecha de vencimiento es obligatoria
fr: La date d’expiration est requise
ja: 有効期限は必須です
ko: 만료 날짜는 필수입니다
pt_br: A data de validade é obrigatória
pt_pt: Data de validade é obrigatória
ru: Требуется срок действия
th: ต้องกรอกวันหมดอายุ
zh_hans: 到期日期为必填项
zh_hant: 到期日為必填

source: For UnionPay, only credit cards can be saved. Click “Pay” to proceed with a one time payment or use another card if you would like to save it for future use.
de: Für UnionPay können nur Kreditkarten gespeichert werden. Klicken Sie auf „Bezahlen“, um mit einer einmaligen Zahlung fortzufahren, oder verwenden Sie eine andere Karte, wenn Sie diese für zukünftige Zahlungen speichern möchten.
es: Para UnionPay, solo se pueden guardar tarjetas de crédito. Haz clic en “Pagar” para proceder con un pago único, o utiliza otra tarjeta si deseas guardarla para uso futuro.
fr: Pour UnionPay, seules les cartes de crédit peuvent être enregistrées. Cliquez sur « Payer » pour effectuer un paiement unique ou utilisez une autre carte si vous souhaitez l’enregistrer pour une utilisation future.
ja: UnionPayではクレジットカードのみ保存できます。「支払う」をクリックして1回限りの支払いを行うか、他のカードを使用して今後の利用のために保存してください。
ko: UnionPay의 경우 신용카드만 저장할 수 있습니다. “결제”를 클릭하여 1회 결제를 진행하거나, 추후 사용을 위해 다른 카드를 저장하세요.
pt_br: Para UnionPay, somente cartões de crédito podem ser salvos. Clique em “Pagar” para prosseguir com um pagamento único ou use outro cartão se quiser salvá-lo para uso futuro.
pt_pt: Para UnionPay, apenas cartões de crédito podem ser guardados. Clique em "Pagar" para efetuar um pagamento único ou use outro cartão se o quiser guardar para utilizações futuras.
ru: Для UnionPay можно сохранить только кредитные карты. Нажмите «Оплатить», чтобы выполнить однократный платеж, или используйте другую карту, если хотите сохранить её для будущего использования.
th: สำหรับ UnionPay สามารถบันทึกเฉพาะบัตรเครดิตเท่านั้น คลิก “ชำระเงิน” เพื่อทำรายการครั้งเดียว หรือใช้บัตรอื่นหากคุณต้องการบันทึกสำหรับการใช้ในอนาคต
zh_hans: 对于银联，只能保存信用卡。点击“支付”进行一次性支付，或使用其他卡片进行保存以便日后使用。
zh_hant: 銀聯僅能儲存信用卡。點選「付款」以進行一次性付款，或使用其他卡片以便日後使用時儲存。

source: Invalid email
de: Ungültige E-Mail-Adresse
es: Correo electrónico no válido
fr: E-mail invalide
ja: メールアドレスが無効です
ko: 유효하지 않은 이메일
pt_br: E-mail inválido
pt_pt: E-mail inválido
ru: Недействительная электронная почта
th: อีเมลไม่ถูกต้อง
zh_hans: 无效的电子邮件
zh_hant: 電子郵件無效

source: Invalid phone number
de: Ungültige Telefonnummer
es: Número de teléfono no válido
fr: Numéro de téléphone invalide
ja: 電話番号が無効です
ko: 유효하지 않은 전화번호
pt_br: Número de telefone inválido
pt_pt: Número de telefone inválido
ru: Неверный номер телефона
th: เบอร์โทรศัพท์ไม่ถูกต้อง
zh_hans: 无效的电话号码
zh_hant: 電話號碼無效

source: Invalid schema
de: Ungültiges Schema
es: Formato no válido
fr: Schéma invalide
ja: スキーマが無効です
ko: 유효하지 않은 형식
pt_br: Esquema inválido
pt_pt: Esquema inválido
ru: Недопустимая схема
th: รูปแบบไม่ถูกต้อง
zh_hans: 无效的格式
zh_hant: 無效的格式

source: Invalid state
de: Ungültiges Bundesland
es: Estado no válido
fr: État invalide
ja: 都道府県が無効です
ko: 유효하지 않은 주
pt_br: Estado inválido
pt_pt: Distrito / Estado inválido
ru: Недействительный штат / область
th: รัฐ / จังหวัดไม่ถูกต้อง
zh_hans: 无效的省/州
zh_hant: 州／省無效

source: Keep using saved cards
de: Gespeicherte Karten weiter verwenden
es: Seguir usando tarjetas guardadas
fr: Continuer à utiliser les cartes enregistrées
ja: 保存済みカードを使い続ける
ko: 저장된 카드를 계속 사용
pt_br: Continuar usando cartões salvos
pt_pt: Continuar a usar cartões guardados
ru: Продолжить использовать сохранённые карты
th: ใช้บัตรที่บันทึกไว้ต่อไป
zh_hans: 继续使用已保存的卡
zh_hant: 繼續使用已儲存卡片

source: Name on card
de: Name auf der Karte
es: Nombre en la tarjeta
fr: Nom sur la carte
ja: カード名義
ko: 카드 이름
pt_br: Nome no cartão
pt_pt: Nome no cartão
ru: Имя на карте
th: ชื่อบนบัตร
zh_hans: 卡上的姓名
zh_hant: 卡片姓名

source: Or pay with
de: Oder bezahlen mit
es: O pagar con
fr: Ou payer avec
ja: または次で支払う
ko: 또는 다음으로 결제
pt_br: Ou pagar com
pt_pt: Ou pagar com
ru: Или оплатить с помощью
th: หรือชำระด้วย
zh_hans: 或使用以下方式支付
zh_hant: 或使用以下方式付款

source: Pay
de: Bezahlen
es: Pagar
fr: Payer
ja: 支払う
ko: 결제
pt_br: Pagar
pt_pt: Pagar
ru: Оплатить
th: ชำระเงิน
zh_hans: 支付
zh_hant: 付款

source: Payment Methods
de: Zahlungsmethoden
es: Métodos de pago
fr: Moyens de paiement
ja: お支払い方法
ko: 결제 수단
pt_br: Métodos de pagamento
pt_pt: Métodos de pagamento
ru: Способы оплаты
th: วิธีการชำระเงิน
zh_hans: 支付方式
zh_hant: 付款方式

source: Phone number
de: Telefonnummer
es: Número de teléfono
fr: Numéro de téléphone
ja: 電話番号
ko: 전화번호
pt_br: Número de telefone
pt_pt: Número de telefone
ru: Номер телефона
th: เบอร์โทรศัพท์
zh_hans: 电话号码
zh_hant: 電話號碼

source: Please enter your city
de: Bitte geben Sie Ihre Stadt ein
es: Por favor, introduce tu ciudad
fr: Veuillez entrer votre ville
ja: 市区町村を入力してください
ko: 도시를 입력하세요
pt_br: Por favor, insira sua cidade
pt_pt: Por favor, introduza a sua cidade
ru: Пожалуйста, введите ваш город
th: กรุณากรอกชื่อเมืองของคุณ
zh_hans: 请输入您的城市
zh_hant: 請輸入您的城市

source: Please enter your country
de: Bitte geben Sie Ihr Land ein
es: Por favor, introduce tu país
fr: Veuillez entrer votre pays
ja: 国を入力してください
ko: 국가를 입력하세요
pt_br: Por favor, insira seu país
pt_pt: Por favor, introduza o seu país
ru: Пожалуйста, введите вашу страну
th: กรุณากรอกประเทศของคุณ
zh_hans: 请输入您的国家
zh_hant: 請輸入您的國家

source: Please enter your first name
de: Bitte geben Sie Ihren Vornamen ein
es: Por favor, introduce tu nombre
fr: Veuillez entrer votre prénom
ja: 名を入力してください
ko: 이름을 입력하세요
pt_br: Por favor, insira seu nome
pt_pt: Por favor, introduza o seu nome
ru: Пожалуйста, введите ваше имя
th: กรุณากรอกชื่อจริงของคุณ
zh_hans: 请输入您的名字
zh_hant: 請輸入您的名字

source: Please enter your last name
de: Bitte geben Sie Ihren Nachnamen ein
es: Por favor, introduce tu apellido
fr: Veuillez entrer votre nom
ja: 姓を入力してください
ko: 성을 입력하세요
pt_br: Por favor, insira seu sobrenome
pt_pt: Por favor, introduza o seu apelido
ru: Пожалуйста, введите вашу фамилию
th: กรุณากรอกนามสกุลของคุณ
zh_hans: 请输入您的姓氏
zh_hant: 請輸入您的姓氏

source: Please enter your name on card
de: Bitte geben Sie den Namen auf der Karte ein
es: Por favor, introduce el nombre en la tarjeta
fr: Veuillez entrer le nom sur la carte
ja: カード名義を入力してください
ko: 카드의 이름을 입력하세요
pt_br: Por favor, insira o nome no cartão
pt_pt: Por favor, introduza o nome no cartão
ru: Пожалуйста, введите имя на карте
th: กรุณากรอกชื่อบนบัตรของคุณ
zh_hans: 请输入卡上的姓名
zh_hant: 請輸入卡片姓名

source: Please enter your street
de: Bitte geben Sie Ihre Straße ein
es: Por favor, introduce tu calle
fr: Veuillez entrer votre rue
ja: 住所を入力してください
ko: 주소를 입력하세요
pt_br: Por favor, insira sua rua
pt_pt: Por favor, introduza a sua rua
ru: Пожалуйста, введите вашу улицу
th: กรุณากรอกชื่อถนน
zh_hans: 请输入您的街道
zh_hant: 請輸入您的街道

source: Please select a bank
de: Bitte wählen Sie eine Bank
es: Por favor, selecciona un banco
fr: Veuillez sélectionner une banque
ja: 銀行を選択してください
ko: 은행을 선택하세요
pt_br: Por favor, selecione um banco
pt_pt: Por favor, selecione um banco
ru: Пожалуйста, выберите банк
th: กรุณาเลือกธนาคาร
zh_hans: 请选择银行
zh_hant: 請選擇銀行

source: Postal code
de: Postleitzahl
es: Código postal
fr: Code postal
ja: 郵便番号
ko: 우편번호
pt_br: CEP
pt_pt: Código postal
ru: Почтовый индекс
th: รหัสไปรษณีย์
zh_hans: 邮政编码
zh_hant: 郵遞區號

source: Remove
de: Entfernen
es: Eliminar
fr: Supprimer
ja: 削除
ko: 삭제
pt_br: Remover
pt_pt: Remover
ru: Удалить
th: ลบ
zh_hans: 移除
zh_hant: 移除

source: Remove %@?
de: Entfernen von %@?
es: ¿Eliminar %@?
fr: Supprimer %@ ?
ja: %@を削除しますか？
ko: %@을(를) 삭제하시겠습니까?
pt_br: Remover %@?
pt_pt: Remover %@?
ru: Удалить %@?
th: ลบ %@ หรือไม่?
zh_hans: 移除%@？
zh_hant: 移除%@？

source: Same as shipping address
de: Wie Versandadresse
es: Igual que la dirección de envío
fr: Identique à l’adresse de livraison
ja: 配送先住所と同じ
ko: 배송지와 동일
pt_br: Igual ao endereço de envio
pt_pt: Igual à morada de envio
ru: То же, что и адрес доставки
th: เหมือนที่อยู่สำหรับจัดส่ง
zh_hans: 与收货地址相同
zh_hant: 同運送地址

source: Save my card for future payments
de: Meine Karte für zukünftige Zahlungen speichern
es: Guardar mi tarjeta para futuros pagos
fr: Enregistrer ma carte pour de futurs paiements
ja: 今後の支払いのためにカードを保存する
ko: 앞으로 결제를 위해 내 카드 저장
pt_br: Salvar meu cartão para pagamentos futuros
pt_pt: Guardar o meu cartão para pagamentos futuros
ru: Сохранить мою карту для будущих платежей
th: บันทึกบัตรของฉันสำหรับการชำระเงินในอนาคต
zh_hans: 保存我的卡用于未来支付
zh_hant: 儲存我的卡片以供未來付款

source: Select your Bank
de: Wählen Sie Ihre Bank
es: Selecciona tu Banco
fr: Sélectionnez votre Banque
ja: 銀行を選択
ko: 은행 선택
pt_br: Selecione seu banco
pt_pt: Selecione o seu banco
ru: Выберите ваш банк
th: เลือกธนาคารของคุณ
zh_hans: 请选择您的银行
zh_hant: 請選擇您的銀行

source: Select...
de: Auswählen...
es: Seleccionar...
fr: Sélectionner...
ja: 選択...
ko: 선택...
pt_br: Selecionar...
pt_pt: Selecionar...
ru: Выбрать...
th: เลือก...
zh_hans: 选择...
zh_hant: 選擇…

source: State
de: Bundesland
es: Estado
fr: État / Région
ja: 都道府県
ko: 주
pt_br: Estado
pt_pt: Distrito / Estado
ru: Штат / Область
th: รัฐ / จังหวัด
zh_hans: 省/州
zh_hant: 州／省

source: Street
de: Straße
es: Calle
fr: Rue
ja: 住所
ko: 주소
pt_br: Rua
pt_pt: Rua
ru: Улица
th: ถนน
zh_hans: 街道
zh_hant: 街道

source: This option will be permanently removed from your saved payment methods.
de: Diese Option wird dauerhaft aus Ihren gespeicherten Zahlungsmethoden entfernt.
es: Esta opción se eliminará permanentemente de sus métodos de pago guardados.
fr: Cette option sera définitivement supprimée de vos moyens de paiement enregistrés.
ja: このオプションは保存されたお支払い方法から完全に削除されます。
ko: 이 옵션은 저장된 결제 수단에서 영구적으로 삭제됩니다.
pt_br: Esta opção será removida permanentemente dos seus métodos de pagamento salvos.
pt_pt: Esta opção será removida permanentemente dos seus métodos de pagamento guardados.
ru: Этот вариант будет навсегда удалён из сохранённых способов оплаты.
th: ตัวเลือกนี้จะถูกลบออกจากวิธีการชำระเงินที่บันทึกไว้ของคุณอย่างถาวร
zh_hans: 该选项将永久从您的已保存支付方式中移除。
zh_hant: 這個選項將永久從您已儲存的付款方式中移除。

source: You will be redirected to complete your payment upon confirmation.
de: Nach Bestätigung werden Sie zur Bezahlung weitergeleitet.
es: Serás redirigido para completar tu pago tras la confirmación.
fr: Vous serez redirigé pour finaliser votre paiement après confirmation.
ja: 確認後、支払い手続きへリダイレクトされます。
ko: 확인 후 결제를 완료하러 이동합니다.
pt_br: Você será redirecionado para concluir seu pagamento após a confirmação.
pt_pt: Será redirecionado para concluir o pagamento após a confirmação.
ru: После подтверждения вы будете перенаправлены для завершения оплаты.
th: คุณจะถูกเปลี่ยนเส้นทางไปหน้าชำระเงินเมื่อยืนยัน
zh_hans: 确认后您将被重定向完成支付。
zh_hant: 確認後您將被重新導向以完成付款。

source: Bank
es: Banco
fr: Banque
ja: 銀行
ko: 은행
pt_br: Banco
pt_pt: Banco
ru: Банк
th: ธนาคาร
zh_hans: 银行
zh_hant: 銀行

source: Email
es: Correo electrónico
ja: メールアドレス
ko: 이메일
ru: Электронная почта
th: อีเมล
zh_hans: 电子邮件
zh_hant: 電子郵件
